cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask-fonts"

# Install Brew Packages
brew "coreutils"
brew "gnutls"
brew "openssl"
brew "git"
brew "python"
brew "vim"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "jq"
brew "htop"
brew "mas"
brew "youtube-dl"

# Install Casks
cask "google-chrome"
cask "docker"
cask "the-unarchiver"
cask "iterm2"
cask "alacritty"
cask "monitorcontrol"
cask "menumeters"
cask "visual-studio-code"
cask "iina"
cask "rectangle"
cask "appcleaner"
cask "spotify"
cask "keka"
# cask "lulu"
cask "knockknock"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "macmediakeyforwarder"
cask "gpg-suite"
cask "telegram"
cask "publii"
cask "blackhole-16ch"
cask "pictogram"
cask "imageoptim"

# Misc
#cask "skype"
cask "fliqlo"

# Work Related Packages
#brew "ansible"
#brew "terraform"
#brew "awscli"
brew "kubernetes-cli"
brew "kubectx"
brew "nmap"
brew "kube-ps1"
#brew "packer"
brew "go"
#brew "minikube"
# brew "npm"
cask "slack"
cask "zoom"
cask "swiftbar"
#cask "postman"
#cask "virtualbox"
#cask "vagrant"

# Install MAS Applications (to run manually with mas cli)
# mas "Amphetamine", id: 937984704
# mas "Noizio", id: 928871589
# mas "Flow", id: 1423210932
# mas "DigiDoc4 Client", id: 1370791134
# mas "Tera", id: 1243347809
