cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask-fonts"

# Install Brew Packages
brew "coreutils"
brew "openssl"
brew "git"
brew "python"
brew "ansible"
brew "terraform"
brew "vim"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "awscli"
brew "kubernetes-cli"
brew "kubectx"
brew "jq"
brew "nmap"
brew "htop"
brew "packer"
brew "go"
brew "mas"
brew "youtube-dl"
brew "minikube"
#brew "npm"

# Install Casks
cask "docker"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "iterm2"
cask "slack"
cask "menumeters"
cask "visual-studio-code"
cask "iina"
cask "spectacle"
cask "appcleaner"
cask "spotify"
cask "skype"
cask "fliqlo"
cask "keka"
cask "lulu"
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "knockknock"
cask "postman"
cask "font-inconsolata"
cask "macmediakeyforwarder"

# Install MAS Applications
mas "Amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "Noizio", id: 928871589
