//vscoss.vscode-ansible
//mauve.terraform

christian-kohler.npm-intellisense
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
eg2.vscode-npm-script
esbenp.prettier-vscode
jasonnutter.search-node-modules
ms-azuretools.vscode-docker
ms-python.python
PKief.material-icon-theme
redhat.vscode-yaml
sleistner.vscode-fileutils
VisualStudioExptTeam.vscodeintellicode
waderyan.nodejs-extension-pack
xabikos.JavaScriptSnippets