ms-python.python
sleistner.vscode-fileutils
PKief.material-icon-theme
EditorConfig.EditorConfig
ngryman.codesandbox-theme
ms-vsliveshare.vsliveshare-pack
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-vscode.test-adapter-converter
bierner.markdown-mermaid
waderyan.nodejs-extension-pack
eamodio.gitlens
dbaeumer.vscode-eslint
GitHub.vscode-pull-request-github
redhat.vscode-yaml
yzhang.markdown-all-in-one
hbenl.vscode-mocha-test-adapter
NicolasVuillamy.vscode-groovy-lint

# christian-kohler.npm-intellisense
# christian-kohler.path-intellisense
# dave-hagedorn.jenkins-runner
# DigitalBrainstem.javascript-ejs-support
# jcbuisson.vue
# johnpapa.vscode-peacock
# ritwickdey.LiveServer
